КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/КонтурЛогистика_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Сотрудники</name>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>(Для кладовщика) если кладовщик указывается, то обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>ИНН физического лица, Обязателен при отсутствии &lt;НомВУ> и &lt;СерВУ> и &lt;ДатаВыдВУ></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеСведения</name>
    <comment>(Для кладовщика) Иные сведения, идентифицирующие физическое лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочий</name>
    <comment>(Для кладовщика) Основание полномочий ТЕКСТ (доверия) на осуществление действий по погрузке груза в транспортное средство: по умолч: &quot;должностные обязанности&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочийДоговор</name>
    <comment>(Для кладовщика)  Основание полномочий ДОГОВОР (доверия) на осуществление действий по погрузке груза в транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВодитель</name>
    <comment>Признак, что Может выступать в качестве водителя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКладовщик</name>
    <comment>Признак, что Может выступать в качестве кладовщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМедик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМеханик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗапасной</name>
    <comment>необязателен</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <comment>обязателен, в любом формате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительства</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительстваСтрана</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗарегестрированВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеКонтактныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенияРаботыСДокументами</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПодписывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПередаватьНаПодпись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/КонтурЛогистика_СервисФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СервисФизическихЛиц</name>
  <resources>
    <name>PersonId</name>
    <comment>Идентификатор физического лица в сервисе физ лиц. У одного сотрудника будут разные id в разных организациях</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UserId</name>
    <comment>Идентификатор связанного портального пользователя. Появляется после принятия приглашения. Для водителей связка выполняется по номеру телефона. Для разных personId может быть один UserId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыФизическихЛиц</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InviteId</name>
    <comment>Идентификатор приглашения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentId</name>
    <comment>Идентификатор документа в сервисе физ. лиц</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСовпадает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПриглашения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииПриглашенийФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыФизическихЛиц/КонтурЛогистика_СтатусыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыФизическихЛиц</name>
  <enumValues>
    <name>НеСоздано</name>
  </enumValues>
  <enumValues>
    <name>НеОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ПринятоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>Удалено</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_МастерДанныеСотрудников/КонтурЛогистика_МастерДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_МастерДанныеСотрудников</name>
  <enumValues>
    <name>Модуль1с</name>
  </enumValues>
  <enumValues>
    <name>Сервис</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_Сотрудники", ЭтаФорма, Элементы.ГруппаСтраницы);
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
	ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
	
	Если ЗначениеЗаполнено(Объект.ОснованиеПолномочийДоговор) Тогда
		ПереключательОснованиеПолномочий = "Иные основания";
	Иначе
		ПереключательОснованиеПолномочий = "Должностные обязанности";
	КонецЕсли;
	
	Параметры.Свойство("ОткрытьПриглашение", ОткрытьПриглашение);
	Параметры.Свойство("ОрганизацияВПриглашение", ОрганизацияВПриглашение);
	Параметры.Свойство("ДокументЭТРН", ДокументЭТРН);
	
	ИнициализироватьСервисФизическихЛиц();	
	
	УстановитьТекущийЭлемент();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
	Если ОткрытьПриглашение Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ФизическиеЛица;
		ДобавитьФизическоеЛицо(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_Сотрудники", Объект.Ссылка);
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ДоступенСервисФизЛиц И Объект.РольВодитель Тогда		
		ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("Сотрудник", Объект.Ссылка);		
		ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц();		
	Иначе	
		УстановитьВидимостьИПараметрыФизическихЛиц();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	СформироватьПредставление();
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	СформироватьПредставление();
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	СформироватьПредставление();
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура СНИЛСПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ВУСерияПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ВУНомерПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ВУДатаВыдачиПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура АдресЭлектроннойПочтыПриИзменении(Элемент)
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставление()

	Объект.Наименование = СокрЛП(Объект.Фамилия);
	
	Если ЗначениеЗаполнено(Объект.Имя) Тогда 
		Объект.Наименование = Объект.Наименование + " " + Лев(СокрЛП(Объект.Имя), 1) + ".";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Отчество) Тогда 
		Объект.Наименование = Объект.Наименование + " " + Лев(СокрЛП(Объект.Отчество), 1) + ".";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаКладовщик.Видимость = Объект.РольКладовщик;
	Элементы.ГруппаВУ.Видимость = Объект.РольВодитель;
	Элементы.ГруппаДОПОГ.Видимость = Объект.РольВодитель;
	Элементы.ГруппаАдресЭП.Видимость = Объект.РольВодитель;
	Элементы.ГруппаМедикРеквизиты.Видимость = Объект.РольМедик;
	Элементы.ГруппаТелеграм.Видимость = ИспользоватьОтправкуВТелеграм;
	
	Если Не Объект.РольВодитель Тогда 
		Элементы.ТелефонОсновной.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		
		Если ЗначениеЗаполнено(Объект.ТелефонОсновной) Тогда
			ИдетПроверкаТелефонаВТелеграм = Истина;
			ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелеграм", 0.1, Истина);
		КонецЕсли;
		
		ОбновитьВидимостьГруппыТелеграм();
		
	КонецЕсли;
	
	ПереключательОснованиеПолномочийИзмененен();
	
	ОбновитьЗаголовкиСтраниц();
		
КонецПроцедуры

&НаКлиенте
Процедура РольВодительПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
	Если ДоступенСервисФизЛиц И Объект.РольВодитель Тогда		
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
			Записать();
		КонецЕсли;
		
		ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("Сотрудник", Объект.Ссылка);
		
	КонецЕсли;
	
	УстановитьВидимостьИПараметрыФизическихЛиц();
		
КонецПроцедуры

&НаКлиенте
Процедура РольКладовщикПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
  
 	Если ИмяСобытия = "КонтурЛогистика_ОбновитьФизическиеЛица" Тогда		
		
		ЭтаФорма.Прочитать();
		Элементы.ФизическиеЛица.Обновить();
		УстановитьВидимостьИПараметрыФизическихЛиц();		
		ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц();
		                                   	
	КонецЕсли;
	
КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстОшибки = Справочники.КонтурЛогистика_Сотрудники.ТекстОшибкиПроверкиИНН(Объект.ИНН);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АдресЭлектроннойПочты)
		И Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КорректноЗаполненПочтовыйАдрес(Объект.АдресЭлектроннойПочты) Тогда
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Некорректный адрес электронной почты """ + Объект.АдресЭлектроннойПочты + """";
		ПараметрыСообщения.ПутьКДанным  = "Объект.АдресЭлектроннойПочты";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
	КонецЕсли;
	
	// Проверим дубли организаций в ТЧ РазрешенияРаботыСДокументами
	РазрешенияРаботыСДокументамиСвернутая = Объект.РазрешенияРаботыСДокументами.Выгрузить();
	РазрешенияРаботыСДокументамиСвернутая.Свернуть("Организация");
	Если РазрешенияРаботыСДокументамиСвернутая.Количество() <> Объект.РазрешенияРаботыСДокументами.Количество() Тогда
		Сообщить("В таблице ""Разрешения работы с документами"" есть дубли строк");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Если ЗначениеЗаполнено(Объект.ТелефонОсновной) Тогда
		Элементы.ГруппаТелеграм.Видимость = Истина;
		
		Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
		Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
		Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
		
		Если ИдетПроверкаТелефонаВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли Объект.ТелефонЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаТелеграм.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелеграм()
	
	ТелефонЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Объект.ТелефонОсновной);
	Если Объект.ТелефонЗарегестрированВТелеграм <> ТелефонЗарегестрированВТелеграм Тогда
		Объект.ТелефонЗарегестрированВТелеграм = ТелефонЗарегестрированВТелеграм;
		Модифицированность = Истина;
	КонецЕсли;
	
	ИдетПроверкаТелефонаВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонОсновнойПриИзменении(Элемент)
	
	Если ИспользоватьОтправкуВТелеграм Тогда
		Если ЗначениеЗаполнено(Объект.ТелефонОсновной) Тогда
			ПроверитьРегистрациюТелеграм();
		КонецЕсли;
		
		ОбновитьВидимостьГруппыТелеграм();
	КонецЕсли;
	
	ЗакрытьСРасхождениями = ЕстьРасхождения;
	УстановитьВидимостьИПараметрыФизическихЛиц();
	ИзменитьТелефонВПриглашение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементУчетнойСистемы(Команда)
	
	Если ЭтаФорма.СписокНастроекКонвертации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Начальное заполнение
	Объект.Фамилия = "Иванов";
	Объект.Имя = "Иван";
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыборЭлементаУчетнойСистемыДляЗаполнения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения");
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыбратьЭлементУчетнойСистемыЗавершение(ВыбранноеЗначение, ДополнительныеПараметры);
	
	УправлениеВидимостьюЭлементовФормыПослеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюЭлементовФормыПослеКонвертации() Экспорт
	
	УстановитьВидимостьЭлементов();
	
	УправлениеВидимостьюЭлементовФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормыСервер()
	
	КонтурЛогистика_КонвертацияСервер.УправлениеВидимостьюЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОснованиеПолномочийПриИзменении(Элемент)
	
	ПереключательОснованиеПолномочийИзмененен();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОснованиеПолномочийИзмененен()
	
	ОснованиеПолномочийДоговор = (ПереключательОснованиеПолномочий = "Иные основания");
	Элементы.ОснованиеПолномочий.Видимость = Не ОснованиеПолномочийДоговор;
	Элементы.ОснованиеПолномочийДоговор.Видимость = ОснованиеПолномочийДоговор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (ПереключательОснованиеПолномочий = "Иные основания") 
		И Не ЗначениеЗаполнено(Объект.ОснованиеПолномочийДоговор) Тогда
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Не заполнены иные основания полномочий";
		ПараметрыСообщения.ПутьКДанным  = "Объект.ОснованиеПолномочийДоговор";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
		
	ИначеЕсли ПереключательОснованиеПолномочий = "Должностные обязанности" Тогда
		
		Объект.ОснованиеПолномочийДоговор = Неопределено;
		
	КонецЕсли;
	
	ИзменитьТелефонВЭТРН();
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц()
	
	// Роли
	ПредставлениеРолей = Новый Массив;
	Если Объект.РольВодитель Тогда
		ПредставлениеРолей.Добавить("водитель");
	КонецЕсли;
	Если Объект.РольКладовщик Тогда
		ПредставлениеРолей.Добавить("кладовщик");
	КонецЕсли;
	Если Объект.РольМедик Тогда
		ПредставлениеРолей.Добавить("медик");
	КонецЕсли;
	Если Объект.РольМеханик Тогда
		ПредставлениеРолей.Добавить("механик");
	КонецЕсли;
	
	Элементы.ГруппаРоли.Заголовок = "Роли";
	Если ПредставлениеРолей.Количество() <> 0 Тогда
		ПредставлениеРолейСтрока = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(ПредставлениеРолей, ", ");
		Элементы.ГруппаРоли.Заголовок = Элементы.ГруппаРоли.Заголовок + " (" + ПредставлениеРолейСтрока + ")";
	КонецЕсли;
	
	// Разрешения работы с документами
	Элементы.ГруппаРазрешенияРаботыСДокументами.Заголовок = "Разрешения работы с документами";
	Если Объект.РазрешенияРаботыСДокументами.Количество() <> 0 Тогда
		Элементы.ГруппаРазрешенияРаботыСДокументами.Заголовок = Элементы.ГруппаРазрешенияРаботыСДокументами.Заголовок
			+ " (" + Строка(Объект.РазрешенияРаботыСДокументами.Количество()) + ")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешенияРаботыСДокументамиПриИзменении(Элемент)
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешенияРаботыСДокументамиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.РазрешенияРаботыСДокументами.ТекущиеДанные.МожетПодписывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешенияРаботыСДокументамиОрганизацияПриИзменении(Элемент)
	
	НоваяОрганизация = Элементы.РазрешенияРаботыСДокументами.ТекущиеДанные.Организация;
	Если Не ЗначениеЗаполнено(НоваяОрганизация) Тогда
		Возврат;
	КонецЕсли;
	
	НашаОрганизация = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(НоваяОрганизация, "Наш");
	Если Не НашаОрганизация Тогда
		Элементы.РазрешенияРаботыСДокументами.ТекущиеДанные.Организация = Неопределено;
		Сообщить("Организация не наша");
		Возврат;
	КонецЕсли;
	
	КоличествоДублей = 0;
	Для Каждого ТекущаяСтрока Из Объект.РазрешенияРаботыСДокументами Цикл
		Если ТекущаяСтрока.Организация <> НоваяОрганизация Тогда
			Продолжить;
		КонецЕсли;
		КоличествоДублей = КоличествоДублей + 1;
	КонецЦикла;
	
	Если КоличествоДублей > 1 Тогда
		Элементы.РазрешенияРаботыСДокументами.ТекущиеДанные.Организация = Неопределено;
		Сообщить("Организация уже добавлена");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийЭлемент()
	
	Если ЭтаФорма.Параметры.Свойство("ТекущийЭлемент") 
		И (ЭтаФорма.Параметры.ТекущийЭлемент = "ФизическиеЛица"
			Или ЭтаФорма.Параметры.ТекущийЭлемент = "ВУСерия"
			Или ЭтаФорма.Параметры.ТекущийЭлемент = "ВУНомер"
			Или ЭтаФорма.Параметры.ТекущийЭлемент = "ВУДатаВыдачи") Тогда 
		ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы.ГруппаРоли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТелефонВЭТРН()
	
	Если Не ЗначениеЗаполнено(ДокументЭТРН) 
		Или Не ЗначениеЗаполнено(ДокументЭТРН.ТелефонВодителя)
		Или ДокументЭТРН.ТелефонВодителя = Объект.ТелефонОсновной Тогда
		Возврат;
	КонецЕсли;
	
	ДокЭТРНОбъект = ДокументЭТРН.ПолучитьОбъект();
	ДокЭТРНОбъект.ТелефонВодителя = Объект.ТелефонОсновной;
	ДокЭТРНОбъект.Записать();
	
КонецПроцедуры

#Область СервисФизическихЛиц

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛиц()
	
	ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицРеквизитыРасхождений();
	ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицДействиеВыгрузитьВСервис();
	ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицДействиеЗагрузитьИзСервиса();
	
	// Сотрудник удален
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.Удалено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 200, 200));
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛица");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицРеквизитыРасхождений()
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		// Выделение красным цветом, еасли есть расхождений
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ЕстьРасхождения" + ИмяРеквизита);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаСотрудник" + ИмяРеквизита);
		ПолеОформления.Использование = Истина;
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛица" + ИмяРеквизита);
		ПолеОформления.Использование = Истина;
		
		// Серым цветом "<совпадают>, если нет расхождений
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ЕстьРасхождения" + ИмяРеквизита);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 200, 200));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "<совпадают>");
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаСотрудник" + ИмяРеквизита);
		ПолеОформления.Использование = Истина;
		
		// Без текста, если нет расхождений
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ЕстьРасхождения" + ИмяРеквизита);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
		
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛица" + ИмяРеквизита);
		ПолеОформления.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицДействиеВыгрузитьВСервис()
	
	// Выгрузить в сервис
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеВыгрузитьВСервис");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "ВыгрузитьВСервис";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Выгрузить в сервис");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеВыгрузитьВСервис");
	ПолеОформления.Использование = Истина;
	
	// Проверить приглашение
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеВыгрузитьВСервис");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "ПроверитьПриглашение";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Проверить приглашение");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеВыгрузитьВСервис");
	ПолеОформления.Использование = Истина;
	
	// Переотправить
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеВыгрузитьВСервис");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "Переотправить";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Переотправить");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеВыгрузитьВСервис");
	ПолеОформления.Использование = Истина;
	
	// <совпадают>
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ЕстьРасхождения" + ИмяРеквизита);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
		
	КонецЦикла;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 200, 200));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "<совпадают>");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеВыгрузитьВСервис");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛицДействиеЗагрузитьИзСервиса()
	
	// Загрузить из сервиса
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеЗагрузитьИзСервиса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "ЗагрузитьИзСервиса";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Загрузить из сервиса");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеЗагрузитьИзСервиса");
	ПолеОформления.Использование = Истина;
	
	// Проверить приглашение
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеЗагрузитьИзСервиса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "ПроверитьПриглашение";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Проверить приглашение");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеЗагрузитьИзСервиса");
	ПолеОформления.Использование = Истина;
	
	// Переотправить
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ДействиеЗагрузитьИзСервиса");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "Переотправить";
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Переотправить");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеЗагрузитьИзСервиса");
	ПолеОформления.Использование = Истина;
	
	// <совпадают>
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.Статус");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение;
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Ключ;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическиеЛица.ЕстьРасхождения" + ИмяРеквизита);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь;
		
	КонецЦикла;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(200, 200, 200));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "<совпадают>");
	
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФизическиеЛицаДействиеЗагрузитьИзСервиса");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФизическоеЛицо(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Сообщить("Необходимо записать сотрудника");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ТелефонОсновной) Тогда
		Сообщить("Не заполнен номер телефона");
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьСотрудникаДляВыгрузкиВСервис();
	Если РезультатПроверки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		"Добавление сотрудника", "Добавить в организацию", "Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента", "Сотрудник");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сотрудник", Объект.Ссылка);
	ПараметрыФормы.Вставить("ОрганизацияВПриглашение", ОрганизацияВПриглашение);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаОтправкиПриглашения", 
		ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОтправкиПриглашения");
		
	Если ЗначениеЗаполнено(ОрганизацияВПриглашение) Тогда
		ОрганизацияВПриглашение = ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьФизическоеЛицо(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Сообщить("Необходимо записать сотрудника");
		Возврат;
	КонецЕсли;
		
	МастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МастерДанныеСотрудников");
	Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
		КонтурЛогистика_СервисФизическихЛицСервер.ВыгрузитьДанныеСотрудникаВСервис(Объект.Ссылка);
		Сообщить("Сотрудник выгружен в сервис");
	Иначе
		КонтурЛогистика_СервисФизическихЛицСервер.ЗагрузитьДанныеСотрудникаИзСервиса(Объект.Ссылка);
		Сообщить("Сотрудник обновлен из сервиса");
	КонецЕсли;
	
	ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц();
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМастерДанные(Команда)

	НастройкаМастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьОбщуюНастройку("МастерДанныеСотрудников");
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(НастройкаМастерДанныеСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФизическоеЛицо(Команда)
	
	ТекущиеДанные = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.Удалено") Тогда
		Сообщить("Сотрудник уже уволен");
		Возврат;
	КонецЕсли;	
		
	ДополнительныеПараметры = Новый Структура("Организация, PersonId", ТекущиеДанные.Организация, ТекущиеДанные.PersonId);
	ОписаниеОповещения = КонтурЛогистика_СтдОбщегоНазначенияКлиент.ОписаниеОповещения(
		"ОбработкаПодтвержденияУдаления", ЭтаФорма, ДополнительныеПараметры);
	
	КонтурЛогистика_СтдДиалогиКлиент.ПоказатьВопросЛок(
		ОписаниеОповещения, "Сотрудник будет удален из организации. Уверены, что хотите удалить сотрудника?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Сообщить("Необходимо записать сотрудника");
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ФизическиеЛицаТелефон"
		И ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИзменениеНомера", Истина);
				
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаОтправкиПриглашения",
			ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОтправкиПриглашения");
	
	ИначеЕсли Поле.Имя = "ФизическиеЛицаДействиеЗагрузитьИзСервиса" Тогда
		
		Если ТекущиеДанные.ДействиеЗагрузитьИзСервиса = "ЗагрузитьИзСервиса" И ЕстьРасхождения Тогда
			
			КонтурЛогистика_СервисФизическихЛицСервер.ЗагрузитьДанныеСотрудникаИзСервисаПоПриглашению(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.PersonId, ТекущиеДанные.Статус);
				
			Сообщить("Данные сотрудника обновлены");
			
		ИначеЕсли ТекущиеДанные.ДействиеЗагрузитьИзСервиса = "ПроверитьПриглашение" Тогда
			
			КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашение(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.PersonId);
				
			Сообщить("Проверка приглашения выполнена");
			
		ИначеЕсли ТекущиеДанные.ДействиеЗагрузитьИзСервиса = "Переотправить" Тогда
			
			РезультатПроверки = КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьДаныеПередОтправкойПриглашения(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.Телефон, Истина);
			Если Не РезультатПроверки Тогда
				Возврат;
			КонецЕсли;
			
			Результат = КонтурЛогистика_СервисФизическихЛицСервер.ОтправитьПриглашение(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.Телефон, ТекущиеДанные.Статус, ТекущиеДанные.PersonId);
				
			Если Результат.ЕстьОшибка Тогда
				Сообщить(Результат.ОписаниеОшибки);
			КонецЕсли;
			
		Иначе
			
			ПараметрыФормы = Новый Структура("Ключ", ВыбраннаяСтрока);  
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаЗаписи", ПараметрыФормы);
			
		КонецЕсли;
		
		ЭтаФорма.Прочитать();
		Элементы.ФизическиеЛица.Обновить();
		
	ИначеЕсли Поле.Имя = "ФизическиеЛицаДействиеВыгрузитьВСервис" Тогда
		
		РезультатПроверки = ПроверитьСотрудникаДляВыгрузкиВСервис();
		Если РезультатПроверки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.ДействиеВыгрузитьВСервис = "ВыгрузитьВСервис" И ЕстьРасхождения Тогда
			
			ИдДокумента = "";
			Если Объект.ВУДатаВыдачи <= ТекущиеДанные.ВУДатаВыдачи 
				ИЛИ (СокрЛП(ТекущиеДанные.ВУСерия) = СокрЛП(Объект.ВУСерия) И СокрЛП(ТекущиеДанные.ВУНомер) = СокрЛП(Объект.ВУНомер)) Тогда
				ИдДокумента = ТекущиеДанные.IdentityDocumentId;	
			КонецЕсли;
			
			КонтурЛогистика_СервисФизическихЛицСервер.ВыгрузитьДанныеСотрудникаВСервисПоПриглашению(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.PersonId, ИдДокумента);
				
			Сообщить("Данные сотрудника выгружены в сервис");
		
		ИначеЕсли ТекущиеДанные.ДействиеВыгрузитьВСервис = "ПроверитьПриглашение" Тогда
			
			КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашение(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.PersonId);
				
			Сообщить("Проверка приглашения выполнена");
				
		ИначеЕсли ТекущиеДанные.ДействиеВыгрузитьВСервис = "Переотправить" Тогда
			
			РезультатПроверки = КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьДаныеПередОтправкойПриглашения(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.Телефон, Истина);
			Если Не РезультатПроверки Тогда
				Возврат;
			КонецЕсли;
			
			Результат = КонтурЛогистика_СервисФизическихЛицСервер.ОтправитьПриглашение(
				ТекущиеДанные.Организация, Объект.Ссылка, ТекущиеДанные.СценарийПриглашения, ТекущиеДанные.Телефон, ТекущиеДанные.Статус, ТекущиеДанные.PersonId);
				
			Если Результат.ЕстьОшибка Тогда
				Сообщить(Результат.ОписаниеОшибки);
			КонецЕсли;
			
		Иначе
				
			ПараметрыФормы = Новый Структура("Ключ", ВыбраннаяСтрока);  
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаЗаписи", ПараметрыФормы);
			
		КонецЕсли;
		
		ЭтаФорма.Прочитать();
		Элементы.ФизическиеЛица.Обновить();
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Ключ", ВыбраннаяСтрока);  
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаЗаписи", ПараметрыФормы);
		
	КонецЕсли;
	
	ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПриАктивизацииПоля(Элемент)
	
	ТекущиеДанные = Элементы.ФизическиеЛица.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФизическиеЛицаКонтекстноеМенюУдалитьФизическоеЛицо.Видимость = ЗначениеЗаполнено(ТекущиеДанные.PersonId) 
		 И ТекущиеДанные.Статус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.Удалено");
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПерейтиКРасхождениямНажатие(Элемент)
	ЭтаФорма.ТекущийЭлемент = Элементы.ФизическиеЛица;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСервисФизическихЛиц()
		
	ДоступенСервисФизЛиц = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступенСервисФизЛиц();
		
	Если ДоступенСервисФизЛиц И Объект.РольВодитель Тогда
		
		ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("Сотрудник", Объект.Ссылка);
		
		КонтурЛогистика_СервисФизическихЛицСервер.ОбновитьФизическиеЛицаСотрудника(Объект.Ссылка);
		ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц();
		
		ЗакрытьСРасхождениями = ЕстьРасхождения;
		
	Иначе
		УстановитьВидимостьИПараметрыФизическихЛиц();
	КонецЕсли;
	
	ЗаполнитьУсловноеОформлениеДляСервисаФизическихЛиц();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИПараметрыФизическихЛиц()
	
	Если ДоступенСервисФизЛиц И Объект.РольВодитель Тогда
		
		Элементы.ГруппаФизическиеЛица.Видимость = Истина;
		
		Если КонтурЛогистика_СервисФизическихЛицСервер.ЕстьПринятоеПриглашение(Объект.Ссылка) Тогда
			
			Элементы.ГруппаБаннерЕстьРасхождения.Видимость = ЕстьРасхождения;
			Элементы.ФизическиеЛицаОписаниеОшибки.Видимость = КонтурЛогистика_СервисФизическихЛицСервер.ЕстьОшибкиОбмена(Объект.Ссылка);
			Если Модифицированность Тогда
				Элементы.ДекорацияЕстьРасхожденияТекстПредупреждения.Заголовок = "Изменились реквизиты сотрудника. Для просмотра расхождений необходимо записать сотрудника.";
				Элементы.ГруппаБаннерЕстьРасхождения.Видимость = Истина;
			Иначе
				Элементы.ДекорацияЕстьРасхожденияТекстПредупреждения.Заголовок = "Есть расхождения данных сотрудника в 1С и сервисе.";
			КонецЕсли;
			Элементы.ДекорацияЗаписать.Видимость = Модифицированность;
			Элементы.ДекорацияПерейтиКРасхождениям.Видимость = Не Модифицированность;
			
		Иначе
			Элементы.ГруппаБаннерЕстьРасхождения.Видимость = Ложь;
		КонецЕсли;
			
	Иначе		
		Элементы.ГруппаФизическиеЛица.Видимость = Ложь;
		Элементы.ГруппаБаннерЕстьРасхождения.Видимость = Ложь;
	КонецЕсли;
	
	МастерДанныеСотрудников = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("МастерДанныеСотрудников");
	Если МастерДанныеСотрудников = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_МастерДанныеСотрудников.Модуль1с") Тогда
		Элементы.ФизическиеЛицаСинхронизироватьФизическоеЛицо.Заголовок = "Выгрузить всех в сервис";
		Элементы.ФизическиеЛицаОткрытьНастройкуМастерДанные.Заголовок = "Источник данных: 1С";
		Элементы.ФизическиеЛицаДействиеЗагрузитьИзСервиса.Видимость = Ложь;
		Элементы.ФизическиеЛицаДействиеВыгрузитьВСервис.Видимость = Истина;
	Иначе
		Элементы.ФизическиеЛицаСинхронизироватьФизическоеЛицо.Заголовок = "Загрузить всех из сервиса";
		Элементы.ФизическиеЛицаОткрытьНастройкуМастерДанные.Заголовок = "Источник данных: сервис";
		Элементы.ФизическиеЛицаДействиеЗагрузитьИзСервиса.Видимость = Истина;
		Элементы.ФизическиеЛицаДействиеВыгрузитьВСервис.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ФизическиеЛицаСинхронизироватьФизическоеЛицо.Видимость = КонтурЛогистика_СервисФизическихЛицСервер.ЕстьПринятоеПриглашение(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОтправкиПриглашения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И Результат.ЕстьОшибка Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	
	Элементы.ФизическиеЛица.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСотрудникаДляВыгрузкиВСервис()
	
	РезультатПроверки = ПроверитьСотрудникаДляВыгрузкиВСервисСервер();
	
	Для каждого Ошибка Из РезультатПроверки Цикл
		Сообщить(Ошибка);
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
Конецфункции

&НаСервере
Функция ПроверитьСотрудникаДляВыгрузкиВСервисСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатПроверки = Справочники.КонтурЛогистика_Сотрудники.ПроверитьСотрудникаПередВыгрузкойВСервис(Объект.Ссылка);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура ОбновитьКолонкиРасхожденийВСпискеФизическихЛиц()
	
	ЕстьРасхождения = Ложь;
	
	Реквизиты = КонтурЛогистика_СервисФизическихЛицКлиентСервер.ОбщиеРеквизитыСотрудникаИФизЛица();
	Для каждого Реквизит Из Реквизиты Цикл
		Элементы["ФизическиеЛицаРасхождения" + Реквизит.Ключ].Видимость = Ложь;
	КонецЦикла;
	
	Отбор = Новый Структура("Сотрудник", Объект.Ссылка);
	Выборка = РегистрыСведений.КонтурЛогистика_СервисФизическихЛиц.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Статус <> Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		Расхождения = КонтурЛогистика_СервисФизическихЛицСервер.ПолучитьРасхождения(Выборка, Объект);
		Если Расхождения.ЕстьРасхождения Тогда
			ЕстьРасхождения = Истина;
		КонецЕсли;
		
		Для каждого Реквизит Из Расхождения.Реквизиты Цикл
			
			Элемент = Элементы["ФизическиеЛицаРасхождения" + Реквизит.Ключ];
			
			Если Элемент.Видимость Тогда
				Продолжить
			КонецЕсли;
			
			Элемент.Видимость = Реквизит.Значение;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьВидимостьИПараметрыФизическихЛиц();
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьНепринятыеПриглашения()
	
	Если ДоступенСервисФизЛиц
		И ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.РольВодитель
		И КонтурЛогистика_СервисФизическихЛицСервер.ЕстьНепринятыеПриглашения(Объект.Ссылка) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ОбработкаПодтвержденияУдаления(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_СервисФизическихЛицСервер.УдалитьФизическоеЛицо(
		ДополнительныеПараметры.Организация, Объект.Ссылка, ДополнительныеПараметры.PersonId);
		
	УстановитьВидимостьИПараметрыФизическихЛиц();
		
	Элементы.ФизическиеЛица.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ДоступенСервисФизЛиц И Объект.РольВодитель 
		И (ЗавершениеРаботы = Неопределено Или Не ЗавершениеРаботы)
		И ЕстьРасхождения И Не ЗакрытьСРасхождениями Тогда
		Отказ = Истина;
		ЗакрытьСРасхождениями = Истина; // закроем форму со 2 раза, если есть расхождения
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЗакрытьСРасхождениями = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаписатьНажатие(Элемент)
	Записать();
	ЭтаФорма.Прочитать();
	УстановитьВидимостьИПараметрыФизическихЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТелефонВПриглашение()
	
	Если ДоступенСервисФизЛиц И ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		КонтурЛогистика_СервисФизическихЛицСервер.ИзменитьТелефонВПриглашение(Объект.Ссылка, Объект.ТелефонОсновной);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
